АлогистикТест2/src/Documents/алк_ВнутренняяПередачаМеждуОрганизациями/алк_ВнутренняяПередачаМеждуОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВнутренняяПередачаМеждуОрганизациями</name>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.алк_ОтгрузкаЩепы</types>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ПередачиСобственныеСерии/алк_ПередачиСобственныеСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПередачиСобственныеСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.алк_ОтгрузкаЩепы</types>
      <types>DocumentRef.алк_РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_РасходнаяНакладная/алк_РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыПоАддендумам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>НАХЕРА?</comment>
    <type>
      <types>EnumRef.алк_ВидыДокументаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнерами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоотвАссортиментуЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>DocumentRef.алк_ЗагрузкаКонтейнера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВнутренняяПередачаМеждуОрганизациями/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	ПериодСт.ДатаНачала    = Объект.ДатаНачало;
	ПериодСт.ДатаОкончания = Объект.ДатаОкончание;  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаНачало    = ПериодСт.ДатаНачала;
	Объект.ДатаОкончание = ПериодСт.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	
	Объект.ДатаНачало = Объект.ДатаСмены;
	Объект.ДатаОкончание = Объект.ДатаСмены;
	
	ПериодСт.ДатаНачала    = Объект.ДатаНачало;
	ПериодСт.ДатаОкончания = Объект.ДатаОкончание;
	
	Объект.Дата = КонецДня(Объект.ДатаСмены);
	Объект.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20");
	
КонецПроцедуры

	
#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПередачиСобственныеСерииОстатки.Номенклатура,
	|	алк_ПередачиСобственныеСерииОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПередачиСобственныеСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов,
	|	алк_ПараметрыПакетовСрезПоследних.Объем
	|ИЗ
	|	РегистрНакопления.алк_ПередачиСобственныеСерии.Остатки КАК алк_ПередачиСобственныеСерииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ПередачиСобственныеСерииОстатки.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерийныйНомер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериод(Команда)
	
	ЗаполнитьЗаПериодНаСервере();
	//РФП 31.10.2023
	//ЗаполнитьЗаПериодЩепаНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьЗаПериодДляПередачиНаИД(Команда) 
	ЗаполнитьЗаПериодНаСервереДляПередачиНаИД();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериодДляПередачиНаТД(Команда)
	ЗаполнитьЗаПериодДляПередачиНаТДНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Грузоотправитель.Код = ""ПБ-000006""
	|	И (НЕ алк_ТранспортировкаЗапасов.Покупатель.Код = ""ПБ-000446""
	|			ИЛИ алк_ТранспортировкаЗапасов.Покупатель = ЗНАЧЕНИЕ(справочник.Контрагенты.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура В(&МассивНоменклатуры)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания); 
	
	МассивНоменклатуры = Новый Массив;
	
	Если Объект.Участок = РазрешенныйУчастокДГСГП() Тогда //ДГ СГП   
		
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018")); //Пеллеты 
		
	Иначе
		
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001")); //Пилмат
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00000000002")); //Шпон 
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006")); //Карандаш 
	    МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017")); //Отходы производства п/м (Хар-ка)  
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002")); //Пиловочник
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры); 

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодНаСервереДляПередачиНаИД() 
	
	Объект.ОрганизацияОтправитель = Справочники.Организации.НайтиПоКоду("00-000001");
	Объект.ОрганизацияПолучатель = Справочники.Организации.НайтиПоКоду("ПБ-000003");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Покупатель.Код = ""ПБ-000446""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);  

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодДляПередачиНаТДНаСервере()
	
	Объект.ОрганизацияОтправитель = Справочники.Организации.НайтиПоКоду("ПБ-000003");
	Объект.ОрганизацияПолучатель = Справочники.Организации.НайтиПоКоду("ПБ-000002");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Продавец.Код = ""ПБ-000006""
	|	И алк_ТранспортировкаЗапасов.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",   Справочники.Организации.НайтиПоКоду("ПБ-000003"));

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать

#КонецОбласти 

// Нач мод [Пакушев И.С.] [16.03.2018] 
// Обращение № [0000000000] [ТекстЗаявки]
// Было
// Стало


&НаСервере
Процедура ЗаполнитьЗаПериодЩепаНаСервере()
	
Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОтгрузкаЩепыЗапасы.Номенклатура,
	|	1 КАК КоличествоПакетов,
	|	алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня КАК Объем,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Ссылка КАК Основание
	|ИЗ
	|	РегистрНакопления.алк_ПередачиСобственныеСерии.Обороты(
	|			,
	|			,
	|			,
	|			Основание ССЫЛКА Документ.алк_ОтгрузкаЩепы
	|				И (Основание.ДатаКУчету_ТД МЕЖДУ &НачалоПериода И &КонецПериода)) КАК алк_ПередачиСобственныеСерииОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
	|		ПО алк_ПередачиСобственныеСерииОбороты.Основание = алк_ОтгрузкаЩепыЗапасы.Ссылка
	|ГДЕ
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД МЕЖДУ &НачалоПериода И &КонецПериода
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.Проведен
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ВыгружатьВ_ТД";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();
				
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтр = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,ВыборкаДетальныеЗаписи);
		
	КонецЦикла; 
	
КонецПроцедуры  

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешенныйУчастокДГСГП()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Код = ""000000039""
	               |	И НЕ алк_Участки.ЭтоГруппа";
	Запрос.УстановитьПараметр("",);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;	
КонецФункции

// Кон мод [Пакушев И.С.] [16.03.2018]
